src/k-bench-results/k0s/reliability-control/reliability-control-2/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1694.07          ---          ---        10.72793         9.72700        21.75900        41.21500       130.50 
Gets        16939.05         7.33     16931.72        10.72373         9.72700        21.75900        41.21500       660.07 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      18633.12         7.33     16931.72        10.72411         9.72700        21.75900        41.21500       790.57 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.783        0.000
SET       8.703        5.000
SET       9.151       10.000
SET       9.279       15.000
SET       9.407       20.000
SET       9.471       25.000
SET       9.535       30.000
SET       9.599       35.000
SET       9.663       40.000
SET       9.663       45.000
SET       9.727       50.000
SET       9.791       52.500
SET       9.791       55.000
SET       9.855       57.500
SET       9.855       60.000
SET       9.919       62.500
SET       9.919       65.000
SET       9.983       67.500
SET      10.047       70.000
SET      10.111       72.500
SET      10.175       75.000
SET      10.239       76.250
SET      10.303       77.500
SET      10.367       78.750
SET      10.495       80.000
SET      10.623       81.250
SET      10.815       82.500
SET      11.135       83.750
SET      11.583       85.000
SET      11.967       86.250
SET      12.415       87.500
SET      12.671       88.125
SET      12.991       88.750
SET      13.439       89.375
SET      14.463       90.000
SET      15.999       90.625
SET      17.023       91.250
SET      17.663       91.875
SET      18.047       92.500
SET      18.303       93.125
SET      18.559       93.750
SET      18.687       94.062
SET      18.815       94.375
SET      18.943       94.688
SET      18.943       95.000
SET      19.071       95.312
SET      19.199       95.625
SET      19.199       95.938
SET      19.327       96.250
SET      19.455       96.562
SET      19.583       96.875
SET      19.583       97.031
SET      19.583       97.188
SET      19.711       97.344
SET      19.711       97.500
SET      19.839       97.656
SET      19.839       97.812
SET      19.967       97.969
SET      20.095       98.125
SET      20.223       98.281
SET      20.351       98.438
SET      20.351       98.516
SET      20.479       98.594
SET      20.607       98.672
SET      20.735       98.750
SET      20.991       98.828
SET      21.247       98.906
SET      21.631       98.984
SET      22.143       99.062
SET      22.655       99.141
SET      23.423       99.219
SET      23.807       99.258
SET      24.191       99.297
SET      24.703       99.336
SET      25.215       99.375
SET      25.855       99.414
SET      26.495       99.453
SET      27.263       99.492
SET      28.159       99.531
SET      29.055       99.570
SET      30.079       99.609
SET      30.591       99.629
SET      31.231       99.648
SET      31.871       99.668
SET      32.639       99.688
SET      33.279       99.707
SET      34.047       99.727
SET      34.815       99.746
SET      35.327       99.766
SET      36.095       99.785
SET      36.607       99.805
SET      37.119       99.814
SET      37.375       99.824
SET      37.887       99.834
SET      38.399       99.844
SET      38.911       99.854
SET      39.167       99.863
SET      39.679       99.873
SET      40.191       99.883
SET      40.703       99.893
SET      41.215       99.902
SET      41.727       99.907
SET      41.983       99.912
SET      42.495       99.917
SET      42.751       99.922
SET      43.263       99.927
SET      43.775       99.932
SET      44.287       99.937
SET      44.543       99.941
SET      45.055       99.946
SET      45.823       99.951
SET      46.079       99.954
SET      46.335       99.956
SET      46.591       99.958
SET      46.847       99.961
SET      47.103       99.963
SET      47.615       99.966
SET      48.127       99.968
SET      48.895       99.971
SET      49.151       99.973
SET      49.919       99.976
SET      50.175       99.977
SET      50.687       99.978
SET      50.943       99.979
SET      51.455       99.980
SET      51.711       99.982
SET      52.223       99.983
SET      52.479       99.984
SET      53.247       99.985
SET      53.759       99.987
SET      54.015       99.988
SET      54.271       99.988
SET      54.783       99.989
SET      55.039       99.990
SET      55.295       99.990
SET      55.551       99.991
SET      55.551       99.991
SET      55.807       99.992
SET      56.575       99.993
SET      57.087       99.993
SET      57.343       99.994
SET      57.855       99.994
SET      57.855       99.995
SET      58.111       99.995
SET      58.623       99.995
SET      58.879       99.995
SET      59.903       99.996
SET      60.671       99.996
SET      60.927       99.996
SET      61.439       99.997
SET      62.207       99.997
SET      62.207       99.997
SET      62.463       99.997
SET      62.463       99.997
SET      62.463       99.998
SET      62.719       99.998
SET      63.743       99.998
SET      63.999       99.998
SET      64.767       99.998
SET      65.023       99.998
SET      65.535       99.998
SET      66.047       99.999
SET      66.047       99.999
SET      66.047       99.999
[...]
SET      67.071       99.999
SET      67.071       99.999
SET      68.607       99.999
SET      71.679       99.999
SET      71.679       99.999
SET      71.679       99.999
SET      72.191       99.999
SET      72.191       99.999
SET      72.191       99.999
SET      73.215       99.999
SET      73.215       99.999
SET      73.215      100.000
SET      73.727      100.000
SET      73.727      100.000
SET      74.751      100.000
SET      74.751      100.000
SET      74.751      100.000
[...]
SET      76.287      100.000
SET      76.287      100.000
SET      76.287      100.000
[...]
SET      76.799      100.000
SET      76.799      100.000
SET      76.799      100.000
[...]
SET      79.359      100.000
SET      79.359      100.000
---
GET       1.255        0.000
GET       8.703        5.000
GET       9.087       10.000
GET       9.279       15.000
GET       9.407       20.000
GET       9.471       25.000
GET       9.535       30.000
GET       9.599       35.000
GET       9.663       40.000
GET       9.663       45.000
GET       9.727       50.000
GET       9.791       52.500
GET       9.791       55.000
GET       9.855       57.500
GET       9.855       60.000
GET       9.919       62.500
GET       9.919       65.000
GET       9.983       67.500
GET      10.047       70.000
GET      10.111       72.500
GET      10.175       75.000
GET      10.239       76.250
GET      10.303       77.500
GET      10.367       78.750
GET      10.495       80.000
GET      10.623       81.250
GET      10.815       82.500
GET      11.135       83.750
GET      11.583       85.000
GET      11.967       86.250
GET      12.415       87.500
GET      12.607       88.125
GET      12.927       88.750
GET      13.375       89.375
GET      14.399       90.000
GET      15.935       90.625
GET      17.023       91.250
GET      17.663       91.875
GET      18.047       92.500
GET      18.303       93.125
GET      18.559       93.750
GET      18.687       94.062
GET      18.815       94.375
GET      18.943       94.688
GET      18.943       95.000
GET      19.071       95.312
GET      19.199       95.625
GET      19.199       95.938
GET      19.327       96.250
GET      19.455       96.562
GET      19.583       96.875
GET      19.583       97.031
GET      19.583       97.188
GET      19.711       97.344
GET      19.711       97.500
GET      19.839       97.656
GET      19.839       97.812
GET      19.967       97.969
GET      20.095       98.125
GET      20.095       98.281
GET      20.351       98.438
GET      20.351       98.516
GET      20.479       98.594
GET      20.607       98.672
GET      20.735       98.750
GET      20.991       98.828
GET      21.247       98.906
GET      21.631       98.984
GET      22.143       99.062
GET      22.655       99.141
GET      23.423       99.219
GET      23.807       99.258
GET      24.191       99.297
GET      24.703       99.336
GET      25.215       99.375
GET      25.727       99.414
GET      26.495       99.453
GET      27.263       99.492
GET      28.031       99.531
GET      28.927       99.570
GET      29.951       99.609
GET      30.591       99.629
GET      31.103       99.648
GET      31.743       99.668
GET      32.383       99.688
GET      33.023       99.707
GET      33.791       99.727
GET      34.559       99.746
GET      35.071       99.766
GET      35.839       99.785
GET      36.607       99.805
GET      37.119       99.814
GET      37.375       99.824
GET      37.887       99.834
GET      38.399       99.844
GET      38.655       99.854
GET      39.167       99.863
GET      39.679       99.873
GET      40.191       99.883
GET      40.703       99.893
GET      41.471       99.902
GET      41.727       99.907
GET      41.983       99.912
GET      42.495       99.917
GET      42.751       99.922
GET      43.263       99.927
GET      43.519       99.932
GET      44.031       99.937
GET      44.543       99.941
GET      45.055       99.946
GET      45.567       99.951
GET      45.823       99.954
GET      46.079       99.956
GET      46.591       99.958
GET      46.847       99.961
GET      47.103       99.963
GET      47.615       99.966
GET      47.871       99.968
GET      48.383       99.971
GET      48.895       99.973
GET      49.407       99.976
GET      49.663       99.977
GET      49.919       99.978
GET      50.175       99.979
GET      50.431       99.980
GET      50.943       99.982
GET      51.199       99.983
GET      51.711       99.984
GET      51.967       99.985
GET      52.479       99.987
GET      52.991       99.988
GET      53.247       99.988
GET      53.759       99.989
GET      54.015       99.990
GET      54.271       99.990
GET      54.783       99.991
GET      55.039       99.991
GET      55.551       99.992
GET      56.063       99.993
GET      56.575       99.993
GET      57.087       99.994
GET      57.343       99.994
GET      57.855       99.995
GET      58.111       99.995
GET      58.623       99.995
GET      58.879       99.995
GET      59.391       99.996
GET      60.159       99.996
GET      60.927       99.996
GET      61.695       99.997
GET      62.207       99.997
GET      62.463       99.997
GET      62.975       99.997
GET      63.487       99.997
GET      63.999       99.998
GET      64.511       99.998
GET      65.023       99.998
GET      65.535       99.998
GET      66.559       99.998
GET      67.071       99.998
GET      68.607       99.998
GET      69.119       99.999
GET      69.631       99.999
GET      70.143       99.999
GET      70.655       99.999
GET      70.655       99.999
GET      71.167       99.999
GET      71.679       99.999
GET      72.191       99.999
GET      72.703       99.999
GET      72.703       99.999
GET      73.215       99.999
GET      73.215       99.999
GET      74.239       99.999
GET      74.239       99.999
GET      74.751       99.999
GET      75.775       99.999
GET      76.287      100.000
GET      77.311      100.000
GET      78.335      100.000
GET      79.359      100.000
GET      79.871      100.000
GET      79.871      100.000
GET      80.383      100.000
GET      80.383      100.000
GET      80.383      100.000
[...]
GET      80.895      100.000
GET      80.895      100.000
GET      81.407      100.000
GET      81.407      100.000
GET      81.407      100.000
[...]
GET      81.919      100.000
GET      82.943      100.000
GET      82.943      100.000
GET      83.455      100.000
GET      83.967      100.000
GET      84.479      100.000
GET      84.991      100.000
GET      84.991      100.000
GET      84.991      100.000
[...]
GET      85.503      100.000
GET      85.503      100.000
GET      85.503      100.000
[...]
GET      86.015      100.000
GET      86.015      100.000
GET      86.015      100.000
[...]
GET      86.527      100.000
GET      86.527      100.000
GET      86.527      100.000
[...]
GET      87.039      100.000
GET      87.039      100.000
---
WAIT      0.000      100.000